In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df_cloud = pd.read_csv('../Data/downloaded/premios_export.csv')

df_local = pd.read_csv('../Data/processed/premios.csv')

In [3]:
df_cloud.sort_values(by='numero_sorteo', inplace=True)
df_local.sort_values(by='numero_sorteo', inplace=True)

In [4]:
df_cloud = df_cloud.drop(columns='id')
df_cloud

,numero_sorteo,numero_premiado,letras,monto,vendedor,ciudad,departamento
13,390,870,PR,950.0,NaN,NaN,NaN
12,390,813,P,600.0,NaN,NaN,NaN
11,390,780,TT,1200.0,NaN,NaN,NaN
10,390,680,DT,600.0,NaN,NaN,NaN
9,390,580,DT,600.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
33074,3070,209,P,700.0,NaN,NaN,NaN
33075,3070,229,P,1000.0,NaN,NaN,NaN
33942,3070,79823,TTR,570.0,NaN,NaN,NaN
33911,3070,76027,P,600.0,NaN,NaN,NaN
33909,3070,75820,TT,600.0,NaN,NaN,NaN

In [5]:
df_local

,numero_sorteo,numero_premiado,letras,monto,vendedor,ciudad,departamento
13,390,870,PR,950.0,NaN,NaN,NaN
12,390,813,P,600.0,NaN,NaN,NaN
11,390,780,TT,1200.0,NaN,NaN,NaN
10,390,680,DT,600.0,NaN,NaN,NaN
9,390,580,DT,600.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
33074,3070,209,P,700.0,NaN,NaN,NaN
33075,3070,229,P,1000.0,NaN,NaN,NaN
33942,3070,79823,TTR,570.0,NaN,NaN,NaN
33911,3070,76027,P,600.0,NaN,NaN,NaN
33909,3070,75820,TT,600.0,NaN,NaN,NaN

In [6]:
df_cloud.isnull().sum()

numero_sorteo          0
numero_premiado        0
letras                 0
monto                  0
vendedor           30433
ciudad             30809
departamento       30809
dtype: int64

In [13]:
df_cloud.duplicated().sum()

np.int64(0)

In [7]:
df_local.isnull().sum()

numero_sorteo          0
numero_premiado        0
letras                 0
monto                  0
vendedor           30433
ciudad             30809
departamento       30809
dtype: int64

In [14]:
df_local.duplicated().sum()

np.int64(0)

In [8]:
df_merged = pd.merge(df_cloud, df_local,
                     on=list(df_cloud.columns),  # all columns must match
                     how="outer",
                     indicator=True)

# Step 3: Filter rows that appear ONLY in the cloud DataFrame
df_only_in_cloud = df_merged[df_merged["_merge"] == "right_only"].drop(columns=["_merge"])

In [9]:
df_only_in_cloud

Empty DataFrame
Columns: [numero_sorteo, numero_premiado, letras, monto, vendedor, ciudad, departamento]
Index: []

In [10]:
df_only_in_cloud.to_csv("rows_only_in_cloud.csv", index=False)

In [11]:
df_merged_local = pd.merge(df_local, df_cloud,
                     on=list(df_local.columns),  # all columns must match
                     how="outer",
                     indicator=True)

# Step 3: Filter rows that appear ONLY in the cloud DataFrame
df_only_in_local = df_merged[df_merged["_merge"] == "right_only"].drop(columns=["_merge"])

In [12]:
df_only_in_local

Empty DataFrame
Columns: [numero_sorteo, numero_premiado, letras, monto, vendedor, ciudad, departamento]
Index: []